src/go/effective/effective-go.org
#+TITLE: Effective Go
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil

 Go 是一门全新的语言。尽管它从既有的语言中借鉴了许多理念，但其与众不同的特性， 使得使用Go编程在本质上就不同于其它语言。将现有的C++或Java程序直译为Go 程序并不能令人满意。毕竟Java程序是用Java编写的，而不是Go。 另一方面，若从Go的角度去分析问题，你就能编写出同样可行但大不相同的程序。 换句话说，要想将Go程序写得好，就必须理解其特性和风格。了解命名、格式化、 程序结构等既定规则也同样重要，这样你编写的程序才能更容易被其他程序员所理解

本文档就如何编写清晰、地道的Go代码提供了一些技巧。它是对语言规范、 Go语言之旅以及 如何使用Go编程的补充说明

* 格式化
 格式化问题总是充满了争议，但却始终没有形成统一的定论。虽说人们可以适应不同的编码风格， 但抛弃这种适应过程岂不更好？若所有人都遵循相同的编码风格，在这类问题上浪费的时间将会更少。 问题就在于如何实现这种设想，而无需冗长的语言风格规范

在Go中另辟蹊径，让机器来处理大部分的格式化问题。 *gofmt* 程序（也可用 go fmt，它以包为处理对象而非源文件）将Go程序按照标准风格缩进、 对齐，保留注释并在需要时重新格式化。若你想知道如何处理一些新的代码布局，请尝试运行 gofmt；若结果仍不尽人意，请重新组织你的程序（或提交有关 gofmt 的Bug），而不必为此纠结

举例来说，你无需花时间将结构体中的字段注释对齐，gofmt 将为你代劳。 假如有以下声明

#+BEGIN_SRC go
  type T struct {
       name string // 对象名
             value int // 对象值
  }
#+END_SRC

 gofmt 会将它按列对齐为： 

#+BEGIN_SRC go
  type T struct {
          name    string // 对象名
          value   int    // 对象值
  }
#+END_SRC

标准包中所有的Go代码都已经用 gofmt 格式化过了

还有一些关于格式化的细节，它们非常简短：
+ 缩进：使用制表符（tab）缩进，gofmt 默认也使用它。在认为 *确实有必要时再使用空格*
+ 行的长度： *Go对行的长度没有限制* 。如果一行实在太长，也可进行折行并插入适当的tab缩进
+ 括号：比起C和Java，Go所需的括号更少：控制结构（if、for 和 switch）在语法上并不需要圆括号。此外，操作符优先级处理变得更加简洁
#+BEGIN_SRC go
  x<<8 + y<<16
#+END_SRC 
 空格符表述了需要所传达的含义

* 注释 
 Go语言支持C风格的块注释 /* */ 和C++风格的行注释 //

 *行注释更为常用，而块注释则主要用作包的注释* ，当然也可在禁用一大段代码时使用

 *godoc* 既是一个程序，又是一个Web服务器，它对Go的源码进行处理，并提取包中的文档内容。 出现在顶级声明之前，且与该声明之间没有空行的注释，将与该声明一起被提取出来，作为该条目的说明文档。 这些注释的类型和风格决定了 godoc 生成的文档质量

** 包注释
+ *每个包都应包含一段包注释* ，即放置在包子句前的一个块注释
+ 对于包含多个文件的包， *包注释只需出现在其中的任一文件中即可* 
+ 包注释应在整体上对该包进行介绍，并提供包的相关信息。 它将出现在 godoc 页面中的最上面，并为紧随其后的内容建立详细的文档

 #+BEGIN_SRC go
   /*
           regexp 包为正则表达式实现了一个简单的库。

           该库接受的正则表达式语法为：

           正则表达式:
                   串联 { '|' 串联 }
           串联:
                   { 闭包 }
           闭包:
                   条目 [ '*' | '+' | '?' ]
           条目:
                   '^'
                   '$'
                   '.'
                   字符
                   '[' [ '^' ] 字符遍历 ']'
                   '(' 正则表达式 ')'
   ,*/
   package regexp
 #+END_SRC

+  若某个包比较简单，包注释同样可以简洁些
#+BEGIN_SRC go
  // path 包实现了一些常用的工具，以便于操作用反斜杠分隔的路径.
#+END_SRC

注释无需进行额外的格式化，如用星号来突出等。生成的输出甚至可能无法以等宽字体显示， 因此不要依赖于空格对齐，godoc 会像 gofmt 那样处理好这一切。 注释是不会被解析的纯文本，因此像HTML或其它类似于 _这样_ 的东西将按照 原样 输出，因此不应使用它们。godoc 所做的调整， 就是将已缩进的文本以等宽字体显示，来适应对应的程序片段。 fmt 包的注释就用了这种不错的效果

godoc 是否会重新格式化注释取决于上下文，因此必须确保它们看起来清晰易辨： 使用正确的拼写、标点和语句结构以及折叠长行等

** 文档注释
+ 在包中 *任何顶级声明前面的注释都将作为该声明的文档注释* 
+ 在程序中 *每个可导出（首字母大写）的名称都应该有文档注释*
+ 文档注释最好是 *完整的句子，这样它才能适应各种自动化的展示。 第一句应当以被声明的东西开头，并且是单句的摘要* 

#+BEGIN_SRC go
  // Compile 用于解析正则表达式并返回，如果成功，则 Regexp 对象就可用于匹配所针对的文本。
  func Compile(str string) (regexp *Regexp, err error) {
#+END_SRC

+ 若注释总是以名称开头，godoc 的输出就能通过 *grep* 变得更加有用

+  Go的声明语法允许成组声明。单个文档注释应介绍一组相关的常量或变量。 由于是整体声明，这种注释往往较为笼统
#+BEGIN_SRC go
  // 表达式解析失败后返回错误代码。
  var (
          ErrInternal      = errors.New("regexp: internal error")
          ErrUnmatchedLpar = errors.New("regexp: unmatched '('")
          ErrUnmatchedRpar = errors.New("regexp: unmatched ')'")
          ...
  )
#+END_SRC

+  即便是对于私有名称，也可通过成组声明来表明各项间的关系，例如某一组由互斥体保护的变量

#+BEGIN_SRC go
  var (
          countLock   sync.Mutex
          inputCount  uint32
          outputCount uint32
          errorCount  uint32
  )
#+END_SRC 

* 命名
 正如命名在其它语言中的地位，它在 Go 中同样重要。有时它们甚至会影响语义： 例如， *某个名称在包外是否可见，就取决于其首个字符是否为大写字母*  因此有必要花点时间来讨论Go程序中的命名约定

