html/go/effective/effective-go.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Effective Go</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">Effective Go</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">格式化</a></li>
<li><a href="#sec-2">注释</a>
<ul>
<li><a href="#sec-2-1">包注释</a></li>
<li><a href="#sec-2-2">文档注释</a></li>
</ul>
</li>
<li><a href="#sec-3">命名</a>
<ul>
<li><a href="#sec-3-1">包名</a></li>
<li><a href="#sec-3-2">setter</a></li>
<li><a href="#sec-3-3">接口名</a></li>
<li><a href="#sec-3-4">驼峰记法</a></li>
</ul>
</li>
<li><a href="#sec-4">分号</a></li>
<li><a href="#sec-5">控制结构</a>
<ul>
<li><a href="#sec-5-1">if</a>
<ul>
<li><a href="#sec-5-1-1">重新声明与再次赋值</a></li>
</ul>
</li>
<li><a href="#sec-5-2">for</a></li>
<li><a href="#sec-5-3">switch</a>
<ul>
<li><a href="#sec-5-3-1">break</a></li>
<li><a href="#sec-5-3-2">类型选择</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">函数</a>
<ul>
<li><a href="#sec-6-1">多值返回</a></li>
<li><a href="#sec-6-2">可命名结果形参</a></li>
<li><a href="#sec-6-3">defer</a></li>
</ul>
</li>
<li><a href="#sec-7">数据</a>
<ul>
<li><a href="#sec-7-1">new 分配</a></li>
<li><a href="#sec-7-2">构造函数与复合字面</a></li>
<li><a href="#sec-7-3">make分配</a></li>
<li><a href="#sec-7-4">数组</a></li>
<li><a href="#sec-7-5">切片</a>
<ul>
<li><a href="#sec-7-5-1">二维切片</a></li>
</ul>
</li>
<li><a href="#sec-7-6">映射</a></li>
<li><a href="#sec-7-7">打印</a></li>
<li><a href="#sec-7-8">追加</a></li>
</ul>
</li>
<li><a href="#sec-8">初始化</a>
<ul>
<li><a href="#sec-8-1">常量</a></li>
<li><a href="#sec-8-2">变量</a></li>
<li><a href="#sec-8-3">初始化</a></li>
</ul>
</li>
<li><a href="#sec-9">方法</a>
<ul>
<li><a href="#sec-9-1">指针 vs 值</a></li>
</ul>
</li>
<li><a href="#sec-10">接口与其它类型</a>
<ul>
<li><a href="#sec-10-1">接口</a></li>
<li><a href="#sec-10-2">类型转换</a></li>
<li><a href="#sec-10-3">接口转换与类型断言</a></li>
<li><a href="#sec-10-4">通用性</a></li>
<li><a href="#sec-10-5">接口与方法</a></li>
</ul>
</li>
<li><a href="#sec-11">空白标识符</a>
<ul>
<li><a href="#sec-11-1">多重赋值中的空白标识符</a></li>
<li><a href="#sec-11-2">未使用的导入和变量</a></li>
<li><a href="#sec-11-3">为副作用而导入</a></li>
<li><a href="#sec-11-4">接口检查</a></li>
</ul>
</li>
<li><a href="#sec-12">内嵌</a></li>
<li><a href="#sec-13">并发</a>
<ul>
<li><a href="#sec-13-1">通过通信共享内存</a></li>
<li><a href="#sec-13-2">Go程</a></li>
<li><a href="#sec-13-3">信道</a></li>
<li><a href="#sec-13-4">信道中的信道</a></li>
<li><a href="#sec-13-5">并行化</a></li>
<li><a href="#sec-13-6">可能泄露的缓冲区</a></li>
</ul>
</li>
<li><a href="#sec-14">错误</a>
<ul>
<li><a href="#sec-14-1">panic</a></li>
<li><a href="#sec-14-2">恢复</a></li>
</ul>
</li>
<li><a href="#sec-15">一个Web服务器</a></li>
</ul>
</div>
</div>
<p>
Go 是一门全新的语言。尽管它从既有的语言中借鉴了许多理念，但其与众不同的特性， 使得使用Go编程在本质上就不同于其它语言。将现有的C++或Java程序直译为Go 程序并不能令人满意。毕竟Java程序是用Java编写的，而不是Go。 另一方面，若从Go的角度去分析问题，你就能编写出同样可行但大不相同的程序。 换句话说，要想将Go程序写得好，就必须理解其特性和风格。了解命名、格式化、 程序结构等既定规则也同样重要，这样你编写的程序才能更容易被其他程序员所理解
</p>

<p>
本文档就如何编写清晰、地道的Go代码提供了一些技巧。它是对语言规范、 Go语言之旅以及 如何使用Go编程的补充说明
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">格式化</h2>
<div class="outline-text-2" id="text-1">
<p>
格式化问题总是充满了争议，但却始终没有形成统一的定论。虽说人们可以适应不同的编码风格， 但抛弃这种适应过程岂不更好？若所有人都遵循相同的编码风格，在这类问题上浪费的时间将会更少。 问题就在于如何实现这种设想，而无需冗长的语言风格规范
</p>

<p>
在Go中另辟蹊径，让机器来处理大部分的格式化问题。 <b>gofmt</b> 程序（也可用 go fmt，它以包为处理对象而非源文件）将Go程序按照标准风格缩进、 对齐，保留注释并在需要时重新格式化。若你想知道如何处理一些新的代码布局，请尝试运行 gofmt；若结果仍不尽人意，请重新组织你的程序（或提交有关 gofmt 的Bug），而不必为此纠结
</p>

<p>
举例来说，你无需花时间将结构体中的字段注释对齐，gofmt 将为你代劳。 假如有以下声明
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">T</span> <span style="color: #00ffff;">struct</span> {
     name string <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#23545;&#35937;&#21517;</span>
           value int <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#23545;&#35937;&#20540;</span>
}
</pre>
</div>

<p>
gofmt 会将它按列对齐为： 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">type</span> <span style="color: #98fb98;">T</span> <span style="color: #00ffff;">struct</span> {
        name    string <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#23545;&#35937;&#21517;</span>
        value   int    <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#23545;&#35937;&#20540;</span>
}
</pre>
</div>

<p>
标准包中所有的Go代码都已经用 gofmt 格式化过了
</p>

<p>
还有一些关于格式化的细节，它们非常简短：
</p>
<ul class="org-ul">
<li>缩进：使用制表符（tab）缩进，gofmt 默认也使用它。在认为 <b>确实有必要时再使用空格</b>
</li>
<li>行的长度： <b>Go对行的长度没有限制</b> 。如果一行实在太长，也可进行折行并插入适当的tab缩进
</li>
<li>括号：比起C和Java，Go所需的括号更少：控制结构（if、for 和 switch）在语法上并不需要圆括号。此外，操作符优先级处理变得更加简洁
</li>
</ul>
<div class="org-src-container">

<pre class="src src-go">x&lt;&lt;8 + y&lt;&lt;16
</pre>
</div>
<p>
空格符表述了需要所传达的含义
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">注释</h2>
<div class="outline-text-2" id="text-2">
<p>
Go语言支持C风格的块注释 <i>* *</i> 和C++风格的行注释 //
</p>

<p>
<b>行注释更为常用，而块注释则主要用作包的注释</b> ，当然也可在禁用一大段代码时使用
</p>

<p>
<b>godoc</b> 既是一个程序，又是一个Web服务器，它对Go的源码进行处理，并提取包中的文档内容。 出现在顶级声明之前，且与该声明之间没有空行的注释，将与该声明一起被提取出来，作为该条目的说明文档。 这些注释的类型和风格决定了 godoc 生成的文档质量
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">包注释</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><b>每个包都应包含一段包注释</b> ，即放置在包子句前的一个块注释
</li>
<li>对于包含多个文件的包， <b>包注释只需出现在其中的任一文件中即可</b> 
</li>
<li>包注释应在整体上对该包进行介绍，并提供包的相关信息。 它将出现在 godoc 页面中的最上面，并为紧随其后的内容建立详细的文档

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">/*</span>
<span style="color: #ff4500;">        regexp &#21253;&#20026;&#27491;&#21017;&#34920;&#36798;&#24335;&#23454;&#29616;&#20102;&#19968;&#20010;&#31616;&#21333;&#30340;&#24211;&#12290;</span>

<span style="color: #ff4500;">        &#35813;&#24211;&#25509;&#21463;&#30340;&#27491;&#21017;&#34920;&#36798;&#24335;&#35821;&#27861;&#20026;&#65306;</span>

<span style="color: #ff4500;">        &#27491;&#21017;&#34920;&#36798;&#24335;:</span>
<span style="color: #ff4500;">                &#20018;&#32852; { '|' &#20018;&#32852; }</span>
<span style="color: #ff4500;">        &#20018;&#32852;:</span>
<span style="color: #ff4500;">                { &#38381;&#21253; }</span>
<span style="color: #ff4500;">        &#38381;&#21253;:</span>
<span style="color: #ff4500;">                &#26465;&#30446; [ '*' | '+' | '?' ]</span>
<span style="color: #ff4500;">        &#26465;&#30446;:</span>
<span style="color: #ff4500;">                '^'</span>
<span style="color: #ff4500;">                '$'</span>
<span style="color: #ff4500;">                '.'</span>
<span style="color: #ff4500;">                &#23383;&#31526;</span>
<span style="color: #ff4500;">                '[' [ '^' ] &#23383;&#31526;&#36941;&#21382; ']'</span>
<span style="color: #ff4500;">                '(' &#27491;&#21017;&#34920;&#36798;&#24335; ')'</span>
<span style="color: #ff4500;">*/</span>
<span style="color: #00ffff;">package</span> regexp
</pre>
</div>
</li>

<li>若某个包比较简单，包注释同样可以简洁些
</li>
</ul>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">path &#21253;&#23454;&#29616;&#20102;&#19968;&#20123;&#24120;&#29992;&#30340;&#24037;&#20855;&#65292;&#20197;&#20415;&#20110;&#25805;&#20316;&#29992;&#21453;&#26012;&#26464;&#20998;&#38548;&#30340;&#36335;&#24452;.</span>
</pre>
</div>

<p>
注释无需进行额外的格式化，如用星号来突出等。生成的输出甚至可能无法以等宽字体显示， 因此不要依赖于空格对齐，godoc 会像 gofmt 那样处理好这一切。 注释是不会被解析的纯文本，因此像HTML或其它类似于 <span class="underline">这样</span> 的东西将按照 原样 输出，因此不应使用它们。godoc 所做的调整， 就是将已缩进的文本以等宽字体显示，来适应对应的程序片段。 fmt 包的注释就用了这种不错的效果
</p>

<p>
godoc 是否会重新格式化注释取决于上下文，因此必须确保它们看起来清晰易辨： 使用正确的拼写、标点和语句结构以及折叠长行等
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">文档注释</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>在包中 <b>任何顶级声明前面的注释都将作为该声明的文档注释</b> 
</li>
<li>在程序中 <b>每个可导出（首字母大写）的名称都应该有文档注释</b>
</li>
<li>文档注释最好是 <b>完整的句子，这样它才能适应各种自动化的展示。 第一句应当以被声明的东西开头，并且是单句的摘要</b> 
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Compile &#29992;&#20110;&#35299;&#26512;&#27491;&#21017;&#34920;&#36798;&#24335;&#24182;&#36820;&#22238;&#65292;&#22914;&#26524;&#25104;&#21151;&#65292;&#21017; Regexp &#23545;&#35937;&#23601;&#21487;&#29992;&#20110;&#21305;&#37197;&#25152;&#38024;&#23545;&#30340;&#25991;&#26412;&#12290;</span>
<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">Compile</span>(str <span style="color: #98fb98;">string</span>) (regexp *<span style="color: #98fb98;">Regexp</span>, err <span style="color: #98fb98;">error</span>) {
</pre>
</div>

<ul class="org-ul">
<li>若注释总是以名称开头，godoc 的输出就能通过 <b>grep</b> 变得更加有用
</li>

<li>Go的声明语法允许成组声明。单个文档注释应介绍一组相关的常量或变量。 由于是整体声明，这种注释往往较为笼统
</li>
</ul>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#34920;&#36798;&#24335;&#35299;&#26512;&#22833;&#36133;&#21518;&#36820;&#22238;&#38169;&#35823;&#20195;&#30721;&#12290;</span>
<span style="color: #00ffff;">var</span> (
        ErrInternal      = errors.<span style="color: #87cefa;">New</span>(<span style="color: #ffa07a;">"regexp: internal error"</span>)
        ErrUnmatchedLpar = errors.<span style="color: #87cefa;">New</span>(<span style="color: #ffa07a;">"regexp: unmatched '('"</span>)
        ErrUnmatchedRpar = errors.<span style="color: #87cefa;">New</span>(<span style="color: #ffa07a;">"regexp: unmatched ')'"</span>)
        ...
)
</pre>
</div>

<ul class="org-ul">
<li>即便是对于私有名称，也可通过成组声明来表明各项间的关系，例如某一组由互斥体保护的变量
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">var</span> (
        countLock   sync.Mutex
        inputCount  uint32
        outputCount uint32
        errorCount  uint32
)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">命名</h2>
<div class="outline-text-2" id="text-3">
<p>
正如命名在其它语言中的地位，它在 Go 中同样重要。有时它们甚至会影响语义： 例如， <b>某个名称在包外是否可见，就取决于其首个字符是否为大写字母</b>  因此有必要花点时间来讨论Go程序中的命名约定
</p>
</div>
