src/go/effective/effective-go.org
** 包名
 当一个包被导入后， *包名就会成了内容的访问器*  

#+BEGIN_SRC go
  import "bytes"
#+END_SRC

之后，被导入的包就能通过 *bytes.Buffer* 来引用了。 若所有人都以相同的名称来引用其内容将大有裨益， 这也就意味着包应当有个恰当的名称：其名称应该简洁明了而易于理解。按照惯例，  *包应当以小写的单个单词来命名，且不应使用下划线或驼峰记法* 。err 的命名就是出于简短考虑的，因为任何使用该包的人都会键入该名称。 不必担心引用次序的冲突。 *包名就是导入时所需的唯一默认名称， 它并不需要在所有源码中保持唯一，即便在少数发生冲突的情况下， 也可为导入的包选择一个别名来局部使用* 无论如何，通过文件名来判定使用的包，都是不会产生混淆的

另一个约定就是包名应为其源码目录的基本名称。在 *src/pkg/encoding/base64* 中的包应作为  *encoding/base64* 导入，其包名应为 *base64*  而非 encoding_base64 或 encodingBase64

包的导入者可通过包名来引用其内容，因此包中的可导出名称可以此来避免冲突。 （请勿使用 *import . 记法* ，它可以简化必须在被测试包外运行的测试， 除此之外应尽量避免使用）例如，bufio 包中的缓存读取器类型叫做 Reader 而非 BufReader，因为用户将它看做 *bufio.Reader* ，这是个清楚而简洁的名称。 此外，由于被导入的项总是通过它们的包名来确定，因此 bufio.Reader 不会与 io.Reader 发生冲突。同样，用于创建 ring.Ring 的新实例的函数（这就是Go中的构造函数）一般会称之为 *NewRing* ，但由于 Ring 是该包所导出的唯一类型，且该包也叫 ring，因此它可以只叫做 *New* ，它跟在包的后面，就像 *ring.New* 使用包结构可以帮助你选择好的名称

 另一个简短的例子是 *once.Do* ，once.Do(setup) 表述足够清晰， 使用 *once.DoOrWaitUntilDone(setup)* 完全就是画蛇添足。 长命名并不会使其更具可读性。一份有用的说明文档通常比额外的长名更有价值 

** setter
Go并不对获取器（getter）和设置器（setter）提供自动支持。 你应当自己提供获取器和设置器，通常很值得这样做，但 *若要将 Get 放到获取器的名字中，既不符合习惯，也没有必要* 。*若你有个名为 owner （小写，未导出）的字段，其获取器应当名为 Owner（大写，可导出）而非 GetOwner* 。大写字母即为可导出的这种规定为区分方法和字段提供了便利。 *若要提供设置器方法，SetOwner 是个不错的选择* 。两个命名看起来都很合理：
#+BEGIN_SRC go
  owner := obj.Owner()
  if owner != user {
          obj.SetOwner(user)
  }
#+END_SRC 

** 接口名
 按照约定， *只包含一个方法的接口应当以该方法的名称加上-er后缀来命名*  如 Reader、Writer、 Formatter、CloseNotifier 等。

诸如此类的命名有很多，遵循它们及其代表的函数名会让事情变得简单。 Read、Write、Close、Flush、 String 等都具有典型的签名和意义。 *为避免冲突，请不要用这些名称为你的方法命名， 除非你明确知道它们的签名和意义相同* 。反之，若你的类型实现了的方法， 与一个众所周知的类型的方法拥有相同的含义，那就使用相同的命名。 *请将字符串转换方法命名为 String 而非 ToString* 

** 驼峰记法
Go中约定使用驼峰记法 *MixedCaps* 或 *mixedCaps* 

* 分号
 和C一样，Go的正式语法使用分号来结束语句；和C不同的是，这些分号并不在源码中出现。 取而代之，词法分析器会使用一条简单的规则来自动插入分号，因此因此源码中基本就不用分号了

规则是这样的： *若在新行前的最后一个标记为标识符（包括 int 和 float64 这类的单词）、数值或字符串常量之类的基本字面或以下标记之一* 
#+BEGIN_EXAMPLE
break continue fallthrough return ++ -- ) }
#+END_EXAMPLE

则词法分析将始终在该标记后面插入分号。这点可以概括为： *如果新行前的标记为语句的末尾，则插入分号* 

分号也可在闭括号之前直接省略，因此像 
#+BEGIN_SRC go
  go func() { for { dst <- <-src } }()
#+END_SRC

 这样的语句无需分号。通常Go程序只在诸如 for 循环子句这样的地方使用分号， 以此来将初始化器、条件及增量元素分开。如果你在一行中写多个语句，也需要用分号隔开

 警告： *无论如何，你都不应将一个控制结构（if、for、switch 或 select）的左大括号放在下一行* 如果这样做，就会在大括号前面插入一个分号，这可能引起不需要的效果。 你应该这样写 
#+BEGIN_SRC go
  if i < f() {
          g()
  }
#+END_SRC

 而不是这样 
#+BEGIN_SRC go
  if i < f()  // 错！
  {           // 错！
          g()
  }
#+END_SRC

* 控制结构
Go中的结构控制与C有许多相似之处，但其不同之处才是独到之处：
+ Go不再使用 *do* 或 *while* 循环，只有一个更通用的 *for*
+ switch 要更灵活一点, *if 和 switch 像 for一样可接受可选的初始化语句*
+ 一个包含类型选择和多路通信复用器的新控制结构：*select* 其语法也有些许不同 *没有圆括号，而其主体必须始终使用大括号括住* 

** if
 在Go中，一个简单的 if 语句看起来像这样： 
#+BEGIN_SRC go
  if x > 0 {
          return y
  }
#+END_SRC

 强制的大括号促使你将简单的 if 语句分成多行。特别是在主体中包含 return 或 break 等控制语句时，这种编码风格的好处一比便知

由于 if 和 switch 可接受初始化语句， 因此 *用它们来设置局部变量十分常见* 

#+BEGIN_SRC go
  if err := file.Chmod(0664); err != nil {
          log.Print(err)
          return err
  }
#+END_SRC

 在Go的库中，你会发现若 if 语句不会执行到下一条语句时，亦即其 *执行体 以 break、continue、goto 或 return 结束时，不必要的 else 会被省略* 

#+BEGIN_SRC go
  f, err := os.Open(name)
  if err != nil {
          return err
  }
  codeUsing(f)
#+END_SRC

 下例是一种常见的情况，代码必须防范一系列的错误条件。若控制流成功继续， 则说明程序已排除错误。由于出错时将以return 结束， 之后的代码也就无需 else 了

#+BEGIN_SRC go
  f, err := os.Open(name)
  if err != nil {
          return err
  }
  d, err := f.Stat()
  if err != nil {
          f.Close()
          return err
  }
  codeUsing(f, d)
#+END_SRC
*** 重新声明与再次赋值
最后一个示例展示了短声明 := 如何使用。 调用了 os.Open 的声明为
#+BEGIN_SRC go
f, err := os.Open(name)
#+END_SRC

 该语句声明了两个变量 f 和 err。在几行之后，又通过 

#+BEGIN_SRC go
  d, err := f.Stat()
#+END_SRC

调用了 f.Stat。它看起来似乎是声明了 d 和 err。 注意 *尽管两个语句中都出现了 err，但这种重复仍然是合法的* ：err 在第一条语句中被声明，但在第二条语句中只是被再次赋值罢了。也就是说，调用 f.Stat 使用的是前面已经声明的 err，它只是被重新赋值了而已

在满足下列条件时，已被声明的变量 v 可出现在:= 声明中：
+ 本次声明与已声明的 v 处于同一作用域中（若 v 已在外层作用域中声明过，则此次声明会创建一个新的变量§）
+ 在初始化中与其类型相应的值才能赋予 v，且在此次声明中至少另有一个变量是新声明的
 
值得一提的是， *即便Go中的函数形参和返回值在词法上处于大括号之外， 但它们的作用域和该函数体仍然相同* 
