src/go/effective/effective-go.org
** for
 Go的 for 循环类似于C，但却不尽相同

+ *它统一了 for 和 while，不再有 do-while 了，它有三种形式，但只有一种需要分号*

#+BEGIN_SRC go
  // 如同C的for循环
  for init; condition; post { }

  // 如同C的while循环
  for condition { }

  // 如同C的for(;;)循环
  for { }
#+END_SRC

+ 简短声明能更容易在循环中声明下标变量：
#+BEGIN_SRC go
  sum := 0
  for i := 0; i < 10; i++ {
          sum += i
  }
#+END_SRC

 + *若你想遍历数组、切片、字符串或者映射，或从信道中读取消息， range 子句能够帮你轻松实现循环* 
#+BEGIN_SRC go
  for key, value := range oldMap {
          newMap[key] = value
  }
#+END_SRC

+  若只需要该遍历中的第一个项（键或下标），去掉第二个就行了

#+BEGIN_SRC go 
  for key := range m {
          if key.expired() {
                  delete(m, key)
          }
  }
#+END_SRC

+  若你只需要该遍历中的第二个项（值），请使用空白标识符，即下划线来丢弃第一个值
#+BEGIN_SRC go
  sum := 0
  for _, value := range array {
          sum += value
  }
#+END_SRC

对于字符串，range 能够提供更多便利。它能通过解析UTF-8， 将每个独立的Unicode码点分离出来。错误的编码将占用一个字节，并以符文U+FFFD来代替。 （名称 *符文* 和内建类型 *rune* 是Go对单个Unicode码点的成称谓。 详情见语言规范） 

#+BEGIN_SRC go  :results output :exports result
  for pos, char := range "日本\x80語" { // \x80 是个非法的UTF-8编码
          fmt.Printf("字符 %#U 始于字节位置 %d\n", char, pos)
  }
#+END_SRC

#+RESULTS:
: 字符 U+65E5 '日' 始于字节位置 0
: 字符 U+672C '本' 始于字节位置 3
: 字符 U+FFFD '?' 始于字节位置 6
: 字符 U+8A9E '語' 始于字节位置 7

+ 若想要在 for 中使用多个变量，应采用平行赋值的方式，它会拒绝 ++ 和 --
#+BEGIN_SRC go
  // 反转 a
  for i, j := 0, len(a)-1; i < j; i, j = i+1, j-1 {
          a[i], a[j] = a[j], a[i]
  }
#+END_SRC 
** switch
Go的 *switch* 比C的更通用。 *其表达式无需为常量或整数* case 语句会自上而下逐一进行求值直到匹配为止。若 switch 后面没有表达式，它将匹配 true，因此，可以将 if-else-if-else 链写成一个 switch，这也更符合Go的风格

#+BEGIN_SRC go
  func unhex(c byte) byte {
          switch {
          case '0' <= c && c <= '9':
                  return c - '0'
          case 'a' <= c && c <= 'f':
                  return c - 'a' + 10
          case 'A' <= c && c <= 'F':
                  return c - 'A' + 10
          }
          return 0
  }
#+END_SRC

+  switch 并不会自动下溯，但 case 可通过逗号分隔来列举相同的处理条件

#+BEGIN_SRC go
  func shouldEscape(c byte) bool {
          switch c {
          case ' ', '?', '&', '=', '#', '+', '%':
                  return true
          }
          return false
  }
#+END_SRC
*** break
break 语句可以使 switch 提前终止。不仅是 switch， 有时候也必须打破层层的循环。在Go中，我们只需将标签放置到循环外，然后 “蹦”到那里即可。下面的例子展示了二者的用法
#+BEGIN_SRC go
  Loop:
  for n := 0; n < len(src); n += size {
          switch {
          case src[n] < sizeOne:
                  if validateOnly {
                          break
                  }
                  size = 1
                  update(src[n])

          case src[n] < sizeTwo:
                  if n+1 >= len(src) {
                          err = errShortInput
                          break Loop
                  }
                  if validateOnly {
                          break
                  }
                  size = 2
                  update(src[n] + src[n+1]<<shift)
          }
  }
#+END_SRC

 *continue 语句也能接受一个可选的标签，不过它只能在循环中使用* 

通过使用两个 switch 语句对字节数组进行比较：
#+BEGIN_SRC go
  // Compare 按字典顺序比较两个字节切片并返回一个整数。
  // 若 a == b，则结果为零；若 a < b；则结果为 -1；若 a > b，则结果为 +1。
  func Compare(a, b []byte) int {
          for i := 0; i < len(a) && i < len(b); i++ {
                  switch {
                  case a[i] > b[i]:
                          return 1
                  case a[i] < b[i]:
                          return -1
                  }
          }
          switch {
          case len(a) > len(b):
                  return 1
          case len(a) < len(b):
                  return -1
          }
          return 0
  }
#+END_SRC
*** 类型选择
 switch 也可用于判断接口变量的动态类型。如 *类型选择* 通过圆括号中的关键字 *type* 使用类型断言语法。若 switch 在表达式中声明了一个变量，那么该变量的每个子句中都将有该变量对应的类型

#+BEGIN_SRC go
  var t interface{}
  t = functionOfSomeType()
  switch t := t.(type) {
  default:
          fmt.Printf("unexpected type %T", t)       // %T 输出 t 是什么类型
  case bool:
          fmt.Printf("boolean %t\n", t)             // t 是 bool 类型
  case int:
          fmt.Printf("integer %d\n", t)             // t 是 int 类型
  case *bool:
          fmt.Printf("pointer to boolean %t\n", *t) // t 是 *bool 类型
  case *int:
          fmt.Printf("pointer to integer %d\n", *t) // t 是 *int 类型
  }
#+END_SRC 
* 函数

