html/go/effective/effective-go.html
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">for</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Go的 for 循环类似于C，但却不尽相同
</p>

<ul class="org-ul">
<li><b>它统一了 for 和 while，不再有 do-while 了，它有三种形式，但只有一种需要分号</b>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22914;&#21516;C&#30340;for&#24490;&#29615;</span>
<span style="color: #00ffff;">for</span> init; condition; post { }

<span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22914;&#21516;C&#30340;while&#24490;&#29615;</span>
<span style="color: #00ffff;">for</span> condition { }

<span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#22914;&#21516;C&#30340;for(;;)&#24490;&#29615;</span>
<span style="color: #00ffff;">for</span> { }
</pre>
</div>

<ul class="org-ul">
<li>简短声明能更容易在循环中声明下标变量：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-go">sum := 0
<span style="color: #00ffff;">for</span> i := 0; i &lt; 10; i++ {
        sum += i
}
</pre>
</div>

<ul class="org-ul">
<li><b>若你想遍历数组、切片、字符串或者映射，或从信道中读取消息， range 子句能够帮你轻松实现循环</b> 
</li>
</ul>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">for</span> key, value := <span style="color: #00ffff;">range</span> oldMap {
        newMap[key] = value
}
</pre>
</div>

<ul class="org-ul">
<li>若只需要该遍历中的第一个项（键或下标），去掉第二个就行了
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">for</span> key := <span style="color: #00ffff;">range</span> m {
        <span style="color: #00ffff;">if</span> key.<span style="color: #87cefa;">expired</span>() {
                <span style="color: #b0c4de;">delete</span>(m, key)
        }
}
</pre>
</div>

<ul class="org-ul">
<li>若你只需要该遍历中的第二个项（值），请使用空白标识符，即下划线来丢弃第一个值
</li>
</ul>
<div class="org-src-container">

<pre class="src src-go">sum := 0
<span style="color: #00ffff;">for</span> _, value := <span style="color: #00ffff;">range</span> array {
        sum += value
}
</pre>
</div>

<p>
对于字符串，range 能够提供更多便利。它能通过解析UTF-8， 将每个独立的Unicode码点分离出来。错误的编码将占用一个字节，并以符文U+FFFD来代替。 （名称 <b>符文</b> 和内建类型 <b>rune</b> 是Go对单个Unicode码点的成称谓。 详情见语言规范） 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">for</span> pos, char := <span style="color: #00ffff;">range</span> <span style="color: #ffa07a;">"&#26085;&#26412;\x80&#35486;"</span> { <span style="color: #ff4500;">// </span><span style="color: #ff4500;">\x80 &#26159;&#20010;&#38750;&#27861;&#30340;UTF-8&#32534;&#30721;</span>
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"&#23383;&#31526; %#U &#22987;&#20110;&#23383;&#33410;&#20301;&#32622; %d\n"</span>, char, pos)
}
</pre>
</div>

<pre class="example">
字符 U+65E5 '日' 始于字节位置 0
字符 U+672C '本' 始于字节位置 3
字符 U+FFFD '?' 始于字节位置 6
字符 U+8A9E '語' 始于字节位置 7
</pre>

<ul class="org-ul">
<li>若想要在 for 中使用多个变量，应采用平行赋值的方式，它会拒绝 ++ 和 &#x2013;
</li>
</ul>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#21453;&#36716; a</span>
<span style="color: #00ffff;">for</span> i, j := 0, <span style="color: #b0c4de;">len</span>(a)-1; i &lt; j; i, j = i+1, j-1 {
        a[i], a[j] = a[j], a[i]
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">switch</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Go的 <b>switch</b> 比C的更通用。 <b>其表达式无需为常量或整数</b> case 语句会自上而下逐一进行求值直到匹配为止。若 switch 后面没有表达式，它将匹配 true，因此，可以将 if-else-if-else 链写成一个 switch，这也更符合Go的风格
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">func</span> <span style="color: #87cefa;">unhex</span>(c <span style="color: #98fb98;">byte</span>) <span style="color: #98fb98;">byte</span> {
        <span style="color: #00ffff;">switch</span> {
        <span style="color: #00ffff;">case</span> <span style="color: #ffa07a;">'0'</span> &lt;= c &amp;&amp; c &lt;= <span style="color: #ffa07a;">'9'</span>:
                <span style="color: #00ffff;">return</span> c - <span style="color: #ffa07a;">'0'</span>
        <span style="color: #00ffff;">case</span> <span style="color: #ffa07a;">'a'</span> &lt;= c &amp;&amp; c &lt;= <span style="color: #ffa07a;">'f'</span>:
                <span style="color: #00ffff;">return</span> c - <span style="color: #ffa07a;">'a'</span> + 10
        <span style="color: #00ffff;">case</span> <span style="color: #ffa07a;">'A'</span> &lt;= c &amp;&amp; c &lt;= <span style="color: #ffa07a;">'F'</span>:
                <span style="color: #00ffff;">return</span> c - <span style="color: #ffa07a;">'A'</span> + 10
        }
        <span style="color: #00ffff;">return</span> 0
}
</pre>
</div>

<ul class="org-ul">
<li>switch 并不会自动下溯，但 case 可通过逗号分隔来列举相同的处理条件
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">func</span> <span style="color: #87cefa;">shouldEscape</span>(c <span style="color: #98fb98;">byte</span>) <span style="color: #98fb98;">bool</span> {
        <span style="color: #00ffff;">switch</span> c {
        <span style="color: #00ffff;">case</span> <span style="color: #ffa07a;">' '</span>, <span style="color: #ffa07a;">'?'</span>, <span style="color: #ffa07a;">'&amp;'</span>, <span style="color: #ffa07a;">'='</span>, <span style="color: #ffa07a;">'#'</span>, <span style="color: #ffa07a;">'+'</span>, <span style="color: #ffa07a;">'%'</span>:
                <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">true</span>
        }
        <span style="color: #00ffff;">return</span> <span style="color: #7fffd4;">false</span>
}
</pre>
</div>
</div>
<div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1">break</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
break 语句可以使 switch 提前终止。不仅是 switch， 有时候也必须打破层层的循环。在Go中，我们只需将标签放置到循环外，然后 “蹦”到那里即可。下面的例子展示了二者的用法
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #7fffd4;">Loop</span>:
<span style="color: #00ffff;">for</span> n := 0; n &lt; <span style="color: #b0c4de;">len</span>(src); n += size {
        <span style="color: #00ffff;">switch</span> {
        <span style="color: #00ffff;">case</span> src[n] &lt; sizeOne:
                <span style="color: #00ffff;">if</span> validateOnly {
                        <span style="color: #00ffff;">break</span>
                }
                size = 1
                <span style="color: #87cefa;">update</span>(src[n])

        <span style="color: #00ffff;">case</span> src[n] &lt; sizeTwo:
                <span style="color: #00ffff;">if</span> n+1 &gt;= <span style="color: #b0c4de;">len</span>(src) {
                        err = errShortInput
                        <span style="color: #00ffff;">break</span> <span style="color: #7fffd4;">Loop</span>
                }
                <span style="color: #00ffff;">if</span> validateOnly {
                        <span style="color: #00ffff;">break</span>
                }
                size = 2
                <span style="color: #87cefa;">update</span>(src[n] + src[n+1]&lt;&lt;shift)
        }
}
</pre>
</div>

<p>
<b>continue 语句也能接受一个可选的标签，不过它只能在循环中使用</b> 
</p>

<p>
通过使用两个 switch 语句对字节数组进行比较：
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #ff4500;">// </span><span style="color: #ff4500;">Compare &#25353;&#23383;&#20856;&#39034;&#24207;&#27604;&#36739;&#20004;&#20010;&#23383;&#33410;&#20999;&#29255;&#24182;&#36820;&#22238;&#19968;&#20010;&#25972;&#25968;&#12290;</span>
<span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#33509; a == b&#65292;&#21017;&#32467;&#26524;&#20026;&#38646;&#65307;&#33509; a &lt; b&#65307;&#21017;&#32467;&#26524;&#20026; -1&#65307;&#33509; a &gt; b&#65292;&#21017;&#32467;&#26524;&#20026; +1&#12290;</span>
<span style="color: #00ffff;">func</span> <span style="color: #87cefa;">Compare</span>(a, b []<span style="color: #98fb98;">byte</span>) <span style="color: #98fb98;">int</span> {
        <span style="color: #00ffff;">for</span> i := 0; i &lt; <span style="color: #b0c4de;">len</span>(a) &amp;&amp; i &lt; <span style="color: #b0c4de;">len</span>(b); i++ {
                <span style="color: #00ffff;">switch</span> {
                <span style="color: #00ffff;">case</span> a[i] &gt; b[i]:
                        <span style="color: #00ffff;">return</span> 1
                <span style="color: #00ffff;">case</span> a[i] &lt; b[i]:
                        <span style="color: #00ffff;">return</span> -1
                }
        }
        <span style="color: #00ffff;">switch</span> {
        <span style="color: #00ffff;">case</span> <span style="color: #b0c4de;">len</span>(a) &gt; <span style="color: #b0c4de;">len</span>(b):
                <span style="color: #00ffff;">return</span> 1
        <span style="color: #00ffff;">case</span> <span style="color: #b0c4de;">len</span>(a) &lt; <span style="color: #b0c4de;">len</span>(b):
                <span style="color: #00ffff;">return</span> -1
        }
        <span style="color: #00ffff;">return</span> 0
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2">类型选择</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
switch 也可用于判断接口变量的动态类型。如 <b>类型选择</b> 通过圆括号中的关键字 <b>type</b> 使用类型断言语法。若 switch 在表达式中声明了一个变量，那么该变量的每个子句中都将有该变量对应的类型
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">var</span> t <span style="color: #00ffff;">interface</span>{}
t = <span style="color: #87cefa;">functionOfSomeType</span>()
<span style="color: #00ffff;">switch</span> t := t.(<span style="color: #00ffff;">type</span>) {
<span style="color: #00ffff;">default</span>:
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"unexpected type %T"</span>, t)       <span style="color: #ff4500;">// </span><span style="color: #ff4500;">%T &#36755;&#20986; t &#26159;&#20160;&#20040;&#31867;&#22411;</span>
<span style="color: #00ffff;">case</span> bool:
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"boolean %t\n"</span>, t)             <span style="color: #ff4500;">// </span><span style="color: #ff4500;">t &#26159; bool &#31867;&#22411;</span>
<span style="color: #00ffff;">case</span> int:
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"integer %d\n"</span>, t)             <span style="color: #ff4500;">// </span><span style="color: #ff4500;">t &#26159; int &#31867;&#22411;</span>
<span style="color: #00ffff;">case</span> *bool:
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"pointer to boolean %t\n"</span>, *t) <span style="color: #ff4500;">// </span><span style="color: #ff4500;">t &#26159; *bool &#31867;&#22411;</span>
<span style="color: #00ffff;">case</span> *int:
        fmt.<span style="color: #87cefa;">Printf</span>(<span style="color: #ffa07a;">"pointer to integer %d\n"</span>, *t) <span style="color: #ff4500;">// </span><span style="color: #ff4500;">t &#26159; *int &#31867;&#22411;</span>
}
</pre>
</div>
</div>
</div>
</div>
</div>
