src/go/effective/effective-go.org
** 多值返回
 Go与众不同的特性之一就是函数和方法可返回多个值。这种形式可以改善C中一些笨拙的习惯： 将错误值返回（例如用 -1 表示 EOF）和修改通过地址传入的实参

在C中，写入操作发生的错误会用一个负数标记，而错误码会隐藏在某个不确定的位置。 而在Go中，Write 会返回写入的字节数以及一个错误： _是的，您写入了一些字节，但并未全部写入，因为设备已满_ 。在 os 包中，File.Write 的签名为： 

#+BEGIN_SRC go
  func (file *File) Write(b []byte) (n int, err error)
#+END_SRC

正如文档所述，它返回写入的字节数，并在n != len(b) 时返回一个非 nil 的 error 错误值 

+ 可以采用一种简单的方法。来避免为模拟引用参数而传入指针。 以下简单的函数可从字节数组中的特定位置获取其值，并返回该数值和下一个位置 

#+BEGIN_SRC go
  func nextInt(b []byte, i int) (int, int) {
          for ; i < len(b) && !isDigit(b[i]); i++ {
          }
          x := 0
          for ; i < len(b) && isDigit(b[i]); i++ {
                  x = x*10 + int(b[i]) - '0'
          }
          return x, i
  }
#+END_SRC

 可以像下面这样，通过它扫描输入的切片 b 来获取数字 
#+BEGIN_SRC go 
  for i := 0; i < len(b); {
          x, i = nextInt(b, i)
          fmt.Println(x)
  }
#+END_SRC 

** 可命名结果形参
 Go函数的返回值或结果 *形参* 可被命名，并作为常规变量使用，就像传入的形参一样。 *命名后，一旦该函数开始执行，它们就会被初始化为与其类型相应的零值, 若该函数执行了一条不带实参的 return 语句，则结果形参的当前值将被返回* 

此名称不是强制性的，但它们能使代码更加简短清晰：它们就是文档。若我们命名了 nextInt 的结果，那么它返回的 int 就值如其意了 
#+BEGIN_SRC go
  func nextInt(b []byte, pos int) (value, nextPos int) {
#+END_SRC 

 由于被命名的结果已经初始化，且已经关联至无参数的返回，它们就能让代码简单而清晰。 下面的 io.ReadFull 就是个很好的例子： 

#+BEGIN_SRC go
  func ReadFull(r Reader, buf []byte) (n int, err error) {
          for len(buf) > 0 && err == nil {
                  var nr int
                  nr, err = r.Read(buf)
                  n += nr
                  buf = buf[nr:]
          }
          return // 无需写return n, err
  }
#+END_SRC
