html/go/effective/effective-go.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">函数</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">多值返回</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Go与众不同的特性之一就是函数和方法可返回多个值。这种形式可以改善C中一些笨拙的习惯： 将错误值返回（例如用 -1 表示 EOF）和修改通过地址传入的实参
</p>

<p>
在C中，写入操作发生的错误会用一个负数标记，而错误码会隐藏在某个不确定的位置。 而在Go中，Write 会返回写入的字节数以及一个错误： <span class="underline">是的，您写入了一些字节，但并未全部写入，因为设备已满</span> 。在 os 包中，File.Write 的签名为： 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">func</span> (file *<span style="color: #98fb98;">File</span>) <span style="color: #87cefa;">Write</span>(b []<span style="color: #98fb98;">byte</span>) (n <span style="color: #98fb98;">int</span>, err <span style="color: #98fb98;">error</span>)
</pre>
</div>

<p>
正如文档所述，它返回写入的字节数，并在n != len(b) 时返回一个非 nil 的 error 错误值 
</p>

<ul class="org-ul">
<li>可以采用一种简单的方法。来避免为模拟引用参数而传入指针。 以下简单的函数可从字节数组中的特定位置获取其值，并返回该数值和下一个位置 
</li>
</ul>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">func</span> <span style="color: #87cefa;">nextInt</span>(b []<span style="color: #98fb98;">byte</span>, i <span style="color: #98fb98;">int</span>) (<span style="color: #98fb98;">int</span>, <span style="color: #98fb98;">int</span>) {
        <span style="color: #00ffff;">for</span> ; i &lt; <span style="color: #b0c4de;">len</span>(b) &amp;&amp; !<span style="color: #87cefa;">isDigit</span>(b[i]); i++ {
        }
        x := 0
        <span style="color: #00ffff;">for</span> ; i &lt; <span style="color: #b0c4de;">len</span>(b) &amp;&amp; <span style="color: #87cefa;">isDigit</span>(b[i]); i++ {
                x = x*10 + <span style="color: #87cefa;">int</span>(b[i]) - <span style="color: #ffa07a;">'0'</span>
        }
        <span style="color: #00ffff;">return</span> x, i
}
</pre>
</div>

<p>
可以像下面这样，通过它扫描输入的切片 b 来获取数字 
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">for</span> i := 0; i &lt; <span style="color: #b0c4de;">len</span>(b); {
        x, i = <span style="color: #87cefa;">nextInt</span>(b, i)
        fmt.<span style="color: #87cefa;">Println</span>(x)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">可命名结果形参</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Go函数的返回值或结果 <b>形参</b> 可被命名，并作为常规变量使用，就像传入的形参一样。 <b>命名后，一旦该函数开始执行，它们就会被初始化为与其类型相应的零值, 若该函数执行了一条不带实参的 return 语句，则结果形参的当前值将被返回</b> 
</p>

<p>
此名称不是强制性的，但它们能使代码更加简短清晰：它们就是文档。若我们命名了 nextInt 的结果，那么它返回的 int 就值如其意了 
</p>
<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">func</span> <span style="color: #87cefa;">nextInt</span>(b []<span style="color: #98fb98;">byte</span>, pos <span style="color: #98fb98;">int</span>) (value, nextPos <span style="color: #98fb98;">int</span>) {
</pre>
</div>

<p>
由于被命名的结果已经初始化，且已经关联至无参数的返回，它们就能让代码简单而清晰。 下面的 io.ReadFull 就是个很好的例子： 
</p>

<div class="org-src-container">

<pre class="src src-go"><span style="color: #00ffff;">func</span> <span style="color: #87cefa;">ReadFull</span>(r <span style="color: #98fb98;">Reader</span>, buf []<span style="color: #98fb98;">byte</span>) (n <span style="color: #98fb98;">int</span>, err <span style="color: #98fb98;">error</span>) {
        <span style="color: #00ffff;">for</span> <span style="color: #b0c4de;">len</span>(buf) &gt; 0 &amp;&amp; err == <span style="color: #7fffd4;">nil</span> {
                <span style="color: #00ffff;">var</span> nr int
                nr, err = r.<span style="color: #87cefa;">Read</span>(buf)
                n += nr
                buf = buf[nr:]
        }
        <span style="color: #00ffff;">return</span> <span style="color: #ff4500;">// </span><span style="color: #ff4500;">&#26080;&#38656;&#20889;return n, err</span>
}
</pre>
</div>
</div>
</div>
